ams/src/Documents/AMS_ПереработкаБрака/AMS_ПереработкаБрака.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ПереработкаБрака</name>
  <registerRecords>InformationRegister._Зарплата</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>EnumRef._ПроизводственныеСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураБрак</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковокБрак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УпаковкаБрак</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБрак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыСтарые</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПереработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыНовые</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Фасовка</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef._Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/_СтоимостьПродукции/_СтоимостьПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_СтоимостьПродукции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/_Зарплата/_Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_Зарплата</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef._Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/_ПроизводственныеСмены/_ПроизводственныеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ПроизводственныеСмены</name>
  <enumValues>
    <name>Дневная</name>
  </enumValues>
  <enumValues>
    <name>Вечерняя</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_ОперацииПроизводства/AMS_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_ОперацииПроизводства</name>
  <enumValues>
    <name>ПеремещениеМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФабрикатов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>СписаниеФабрикатаСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеБракаВЦех</name>
    <comment>Перемещение брака в цех (из склада бракованной продукции)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехе</name>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехеОрдер</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБракаОрдер</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловБракаВОтходы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПроизведеннойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукцииИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФлаконов</name>
  </enumValues>
  <enumValues>
    <name>ПриемИзПереработки</name>
    <comment>Прием из переработки (давальческого сырья)</comment>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/ОрдерНаОтражениеНедостачТоваров/ОрдерНаОтражениеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОрдерНаОтражениеНедостачТоваров</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>_ОперацияПроизводства</name>
    <type>
      <types>EnumRef.AMS_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>_Основание</name>
    <type>
      <types>DocumentRef.AMS_ПереработкаБрака</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтролируемаяПартия</name>
      <type>
        <types>CatalogRef.КонтролируемыеПартии</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/AMS_ПереработкаБрака/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не Пользователи.РолиДоступны("_НачальникЦеха, _ГлавныйБухгалтер, _Бухгалтер") Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если Пользователи.РолиДоступны("_Цех1") Тогда
		Склад = AMS_ВызовСервера.Цех1();

	ИначеЕсли Пользователи.РолиДоступны("_Цех2") Тогда
		Склад = AMS_ВызовСервера.Цех2();
	
	ИначеЕсли Пользователи.РолиДоступны("_Цех3") Тогда
		Склад = AMS_ВызовСервера.Цех3();
	КонецЕсли;

	Автор = Пользователи.ТекущийПользователь();
	Смена = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._ПроизводственныеСмены.Дневная");
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не Склад = AMS_ВызовСервера.ПолучитьЦехНоменклатуры(Номенклатура) Тогда
		ТекстОшибки = """" + Номенклатура + """ не является продукцией склада """ + Склад + """.";
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;

	Для Каждого Стр Из МатериалыСтарые Цикл
		Если Не Стр.Количество = Стр.КоличествоОтходы + Стр.КоличествоПереработка Тогда
			ТекстОшибки = "В таблице ""Материалы в составе бракованной продукции"" для """ + Стр.Номенклатура
				+ """ указано не правильное количество ""в отходы"" или ""в переработку"".";
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
	КонецЦикла;

	ПроверитьНаличиеНоменклатураБрак_МатериалыНовые(Отказ);

	Если Дата > КонецДня(ТекущаяДатаСеанса()) Тогда
		ТекстОшибки = "Проведение будущей датой запрещено.";
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыСведений._СтоимостьПродукции.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Период.Установить(Дата);

	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Период       = НачалоДня(Дата);
	НоваяЗапись.Номенклатура = Номенклатура;
	НоваяЗапись.Стоимость    = Цена;

	НаборЗаписей.Записать();

	//

	Подразделение = мср.СоответствиеЦехПодразделение().Получить(Склад);

	Если Склад = AMS_ВызовСервера.Цех1() Тогда
		ФасовкаПродукции = Справочники._Работы.Фасовка1;
		
	ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
		ФасовкаПродукции = Справочники._Работы.Фасовка2;
		
	ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
		ФасовкаПродукции = Справочники._Работы.Фасовка3;
	КонецЕсли;

	Движения._Зарплата.Записывать = Истина;

	//@skip-check expression-not-collection
	Для Каждого Стр Из Фасовка Цикл
		Движение = Движения._Зарплата.Добавить();

		Движение.Период        = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Сотрудник     = Стр.Сотрудник;
		Движение.Работа        = ФасовкаПродукции;
		Движение.Сумма         = Стр.Сумма;
	КонецЦикла;

	Для Каждого Стр Из Работы Цикл
		Движение = Движения._Зарплата.Добавить();

		Движение.Период        = Дата;
		Движение.Подразделение = Подразделение;
		Движение.Сотрудник     = Стр.Сотрудник;
		Движение.Работа        = Стр.Работа;
		Движение.Сумма         = Стр.Сумма;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Дата = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок = AMS_Сервер.ПолучитьДокументыПереработкиБрака(Ссылка);
	
	Если Проведен Тогда
		ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач");
		
		ОформитьПеремещениеБракаВЦех(ТабДок, Отказ);
		
		ОформитьСписаниеБракаВЦехе_Списание(ТабДок, Отказ);
		ОформитьОприходованиеМатериалов_Оприходование(ТабДок, Отказ);

		Если Дата >= ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач Тогда
			ОформитьСписаниеБракаВЦехе_Ордер(ТабДок, Отказ);
			ОформитьОприходованиеМатериалов_Ордер(ТабДок, Отказ);
		КонецЕсли;
		
		ОформитьПеремещениеМатериаловВОтходы(ТабДок, Отказ);
		ОформитьВнутреннееПотреблениеМатериалов(ТабДок, Отказ);
		ОформитьОприходованиеПродукции(ТабДок, Отказ);
		
		ОпменитьПеремещениеМатериаловДопЦех(ТабДок, Отказ);
	
	ИначеЕсли ПометкаУдаления Тогда
		Для каждого Стр Из ТабДок Цикл
			мср.УстановитьПометкуУдаленияДокументу(Стр.Ссылка, Истина);
		КонецЦикла;
	
	Иначе	
		Для каждого Стр Из ТабДок Цикл
			Если Стр.Проведен Тогда
				мср.ЗаписатьДокумент(Стр.Ссылка, РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОформитьПеремещениеБракаВЦех(ТабДок, Отказ)
	Стр = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.ПеремещениеБракаВЦех);
	
	Если Стр = Неопределено Тогда
		Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
	Иначе
		Док = Стр.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Док.Дата                       = Дата;
	Док.Организация                = Организация;
	Док.Статус                     = Перечисления.СтатусыПеремещенийТоваров.Принято;
	Док.СкладОтправитель           = AMS_ВызовСервера.СкладБракованнойПродукции();
	Док.СкладПолучатель            = Склад;
	Док.ВидЦены                    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
	Док.СпособДоставки             = Перечисления.СпособыДоставки.Самовывоз;
	Док.ВариантПриемкиТоваров      = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док.ПеремещениеПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Док.НаправлениеДеятельности    = Справочники.НаправленияДеятельности.НайтиПоНаименованию("Продажа", Истина);
	Док.Подразделение              = AMS_ВызовСервера.ПодразделениеПроизводство();
	Док.ХозяйственнаяОперация      = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	Док.Ответственный              = Автор;
	Док.Автор                      = Автор;
	Док._Основание                 = Ссылка;
	Док._ОперацияПроизводства      = Перечисления.AMS_ОперацииПроизводства.ПеремещениеБракаВЦех;
	Док.Комментарий = "Сформирован автоматичестки. Перемещение бракованной продукции на переработу (Переработка брака № "
		+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";

	Док.Товары.Очистить();

	Стр = Док.Товары.Добавить();

	Стр.Номенклатура       = НоменклатураБрак;
	Стр.Количество         = КоличествоБрак;
	Стр.КоличествоУпаковок = КоличествоУпаковокБрак;
	Стр.Упаковка           = УпаковкаБрак;
	
	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
КонецПроцедуры

Процедура ОформитьСписаниеБракаВЦехе_Списание(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеБракаВЦехе);
	
	Если СтрДок = Неопределено Тогда
		Док = Документы.СписаниеНедостачТоваров.СоздатьДокумент();
	Иначе
		Док = СтрДок.Ссылка.ПолучитьОбъект();
	КонецЕсли;

	Док.Дата                              = Дата + 10;
	Док.Организация                       = Организация;
	Док.Склад                             = Склад;
	Док.Подразделение                     = мср.СоответствиеЦехПодразделение().Получить(Склад);
	Док.СтатьяРасходов                    = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000079");
	Док.ВидЦены                           = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
	Док.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен;
	Док.Ответственный                     = Автор;
	Док.Автор                             = Автор;
	Док._Основание                        = Ссылка;
	Док._ОперацияПроизводства             = Перечисления.AMS_ОперацииПроизводства.СписаниеБракаВЦехе;
	Док.Комментарий = "Сформирован автоматичестки. Списание бракованной продукции (Переработка брака № "
		+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";

	Док.Товары.Очистить();

	Стр = Док.Товары.Добавить();

	Стр.Номенклатура = НоменклатураБрак;
	Стр.Количество   = КоличествоБрак;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
КонецПроцедуры

Процедура ОформитьСписаниеБракаВЦехе_Ордер(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеБракаВЦехеОрдер);
	
	Если СтрДок = Неопределено Тогда
		Док = Документы.ОрдерНаОтражениеНедостачТоваров.СоздатьДокумент();
	Иначе
		Док = СтрДок.Ссылка.ПолучитьОбъект();
	КонецЕсли;

	Док.Дата                  = Дата + 10;
	Док.Склад                 = Склад;
	Док.Ответственный         = Автор;
	Док._Основание            = Ссылка;
	Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.СписаниеБракаВЦехеОрдер;
	Док.Комментарий = "Сформирован автоматичестки. Списание бракованной продукции (Переработка брака № "
		+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";

	Док.Товары.Очистить();

	Стр = Док.Товары.Добавить();

	Стр.Номенклатура       = НоменклатураБрак;
	Стр.Количество         = КоличествоБрак;
	Стр.КоличествоУпаковок = КоличествоБрак;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
КонецПроцедуры

Процедура ОформитьОприходованиеМатериалов_Оприходование(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.ОприходованиеМатериаловИзБрака);
	
	Если СтрДок = Неопределено Тогда
		Док = Документы.ОприходованиеИзлишковТоваров.СоздатьДокумент();
	Иначе
		Док = СтрДок.Ссылка.ПолучитьОбъект();
	КонецЕсли;

	Док.Дата                  = Дата;
	Док.Организация           = Организация;
	Док.Склад                 = Склад;
	Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
	Док.Валюта                = Константы.ВалютаУправленческогоУчета.Получить();
	Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
	Док.СтатьяДоходов         = ПланыВидовХарактеристик.СтатьиДоходов.НайтиПоКоду("01-000001");
	Док.Ответственный         = Автор;
	Док.Автор                 = Автор;
	Док._Основание            = Ссылка;
	Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ОприходованиеМатериаловИзБрака;
	Док.Комментарий = "Сформирован автоматичестки. Оприходование материалов из состава бракованной продукции (Переработка брака № "
		+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";

	Док.Товары.Очистить();

	Для Каждого Стр Из МатериалыСтарые Цикл
		НовСтр = Док.Товары.Добавить();
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.Количество;
		Если Стр.Цена < 0.01 Тогда
			НовСтр.Цена = 0.01;
		Иначе
			НовСтр.Цена = Стр.Цена;
		КонецЕсли;
		НовСтр.Сумма = НовСтр.Количество * НовСтр.Цена;
	КонецЦикла;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
КонецПроцедуры

Процедура ОформитьОприходованиеМатериалов_Ордер(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.ОприходованиеМатериаловИзБракаОрдер);
	
	Если СтрДок = Неопределено Тогда
		Док = Документы.ОрдерНаОтражениеИзлишковТоваров.СоздатьДокумент();
	Иначе
		Док = СтрДок.Ссылка.ПолучитьОбъект();
	КонецЕсли;

	Док.Дата                  = Дата;
	Док.Склад                 = Склад;
	Док.Ответственный         = Автор;
	Док._Основание            = Ссылка;
	Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ОприходованиеМатериаловИзБракаОрдер;
	Док.Комментарий = "Сформирован автоматичестки. Оприходование материалов из состава бракованной продукции (Переработка брака № "
		+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";

	Док.Товары.Очистить();

	Для Каждого Стр Из МатериалыСтарые Цикл
		НовСтр = Док.Товары.Добавить();
		НовСтр.Номенклатура       = Стр.Номенклатура;
		НовСтр.Количество         = Стр.Количество;
		НовСтр.КоличествоУпаковок = Стр.Количество;
	КонецЦикла;

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
КонецПроцедуры

Процедура ОформитьПеремещениеМатериаловВОтходы(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.ПеремещениеМатериаловБракаВОтходы);
	
	Табл = Новый ТаблицаЗначений();
	Табл.Колонки.Добавить("Номенклатура");
	Табл.Колонки.Добавить("Количество");

	Для Каждого Стр Из МатериалыСтарые Цикл
		Если Стр.КоличествоОтходы > 0 Тогда
			НовСтр = Табл.Добавить();
			НовСтр.Номенклатура = Стр.Номенклатура;
			НовСтр.Количество = Стр.КоличествоОтходы;
		КонецЕсли;
	КонецЦикла;
	
	Если Табл.Количество() = 0 И Не СтрДок = Неопределено Тогда
			мср.УстановитьПометкуУдаленияДокументу(СтрДок.Ссылка, Истина);
		
	Иначе	
		Если СтрДок = Неопределено Тогда
			Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Иначе
			Док = СтрДок.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		Док.Дата                       = Дата + 10;
		Док.Организация                = Организация;
		Док.Статус                     = Перечисления.СтатусыПеремещенийТоваров.Принято;
		Док.СкладОтправитель           = Склад;
		Док.СкладПолучатель            = Справочники.Склады.НайтиПоНаименованию("Склад возвратных отходов", Истина);
		Док.ВидЦены                    = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.СпособДоставки             = Перечисления.СпособыДоставки.Самовывоз;
		Док.ВариантПриемкиТоваров      = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.ПеремещениеПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Док.ХозяйственнаяОперация      = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Док.Ответственный              = Автор;
		Док.Автор                      = Автор;
		Док.Подразделение              = AMS_ВызовСервера.ПодразделениеПроизводство();
		Док.НаправлениеДеятельности    = Справочники.НаправленияДеятельности.НайтиПоНаименованию("Продажа", Истина);
		Док._Основание                 = Ссылка;
		Док._ОперацияПроизводства      = Перечисления.AMS_ОперацииПроизводства.ПеремещениеМатериаловБракаВОтходы;
		Док.Комментарий = "Сформирован автоматичестки. Перемещение неиспользуемых материалов на склад отходов (Переработка брака № "
			+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";
	
		Док.Товары.Очистить();
	
		Для Каждого Стр Из Табл Цикл
			НовСтр = Док.Товары.Добавить();
			НовСтр.Номенклатура       = Стр.Номенклатура;
			НовСтр.Количество         = Стр.Количество;
			НовСтр.КоличествоУпаковок = Стр.Количество;
		КонецЦикла;
	
		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ОформитьВнутреннееПотреблениеМатериалов(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловНаПереработкуБрака);
	
	Табл = Новый ТаблицаЗначений();
	Табл.Колонки.Добавить("Номенклатура");
	Табл.Колонки.Добавить("Количество");
	
	Для Каждого Стр Из МатериалыСтарые Цикл
		Если Стр.КоличествоПереработка > 0 Тогда
			НовСтр = Табл.Добавить();
			НовСтр.Номенклатура = Стр.Номенклатура;
			НовСтр.Количество   = Стр.КоличествоПереработка;
		КонецЕсли;
	КонецЦикла;

	Для Каждого Стр Из МатериалыНовые Цикл
		Если AMS_ВызовСервера.ЭтоФабрикат(Стр.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = Табл.Добавить();
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.Количество;
	КонецЦикла;

	Для Каждого Стр Из Сырье Цикл
		НовСтр = Табл.Добавить();
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.Количество;
	КонецЦикла;
	
	Табл.Свернуть("Номенклатура", "Количество");
	Табл.Сортировать("Номенклатура");
	
	Если Табл.Количество() = 0 И Не СтрДок = Неопределено Тогда
			мср.УстановитьПометкуУдаленияДокументу(СтрДок.Ссылка, Истина);
		
	Иначе	
		Если СтрДок = Неопределено Тогда
			Док = Документы.ВнутреннееПотребление.СоздатьДокумент();
		Иначе
			Док = СтрДок.Ссылка.ПолучитьОбъект();
		КонецЕсли;

		Док.Дата                  = Дата + 20;
		Док.Организация           = Организация;
		Док.Склад                 = Склад;
		Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
		Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		Док.Ответственный         = Автор;
		Док._Основание            = Ссылка;
		Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловНаПереработкуБрака;
		Док.Комментарий = "Сформирован автоматичестки. Списание материалов на переработку бракованной продукции (Переработка брака № "
			+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";
	
		Док.Товары.Очистить();
		
		АналитикаРасходов = Справочники.ПрочиеРасходы.НайтиПоНаименованию("Материалы в производство", Истина);
		
		Для Каждого Стр Из Табл Цикл
			НовСтр = Док.Товары.Добавить();
	
			НовСтр.Номенклатура       = Стр.Номенклатура;
			НовСтр.КоличествоУпаковок = Стр.Количество;
			НовСтр.Количество         = Стр.Количество;
			НовСтр.СтатьяРасходов     = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000082");
			НовСтр.АналитикаРасходов  = АналитикаРасходов;
		КонецЦикла;
	
		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ОформитьОприходованиеПродукции(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.ПроизводствоПродукцииИзБрака);

	Если СтрДок = Неопределено Тогда
		Док = Документы.ПрочееОприходованиеТоваров.СоздатьДокумент();
	Иначе
		Док = СтрДок.Ссылка.ПолучитьОбъект();
	КонецЕсли;

	Док.Дата                  = Дата + 30;
	Док.Организация           = Организация;
	Док.Склад                 = Склад;
	Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
	Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
	Док.Валюта                = Константы.ВалютаУправленческогоУчета.Получить();
	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеИзПроизводства;
	Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
	Док._Основание            = Ссылка;
	Док._ОперацияПроизводства = Перечисления.AMS_ОперацииПроизводства.ПроизводствоПродукцииИзБрака;
	Док.Ответственный         = Автор;
	Док.Комментарий = "Сформирован автоматичестки. Оприходование переработанной бракованной продукции (Переработка брака № "
		+ Номер + " от " + Формат(Док.Дата, "ДЛФ=Д") + " г.)";

	Док.Товары.Очистить();

	Стр = Док.Товары.Добавить();
	Стр.Номенклатура = Номенклатура;
	Стр.Упаковка = Упаковка;
	Стр.КоличествоУпаковок = КоличествоУпаковок;
	Стр.Количество = Количество;
	Стр.Цена = Цена * ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "КоэффициентЕдиницыДляОтчетов");
	Стр.Сумма = Цена * Количество;
	Стр.СтатьяРасходовДоходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000081");
	Стр.АналитикаРасходов = AMS_ВызовСервера.ПодразделениеПроизводство();

	мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ);
КонецПроцедуры

Процедура ОпменитьПеремещениеМатериаловДопЦех(ТабДок, Отказ)
	СтрДок = ТабДок.Найти(Перечисления.AMS_ОперацииПроизводства.ПеремещениеМатериаловНаПереработкуБрака);

	Если Не СтрДок = Неопределено Тогда
		мср.УстановитьПометкуУдаленияДокументу(СтрДок.Ссылка, Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьНаличиеНоменклатураБрак_МатериалыНовые(Отказ)
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("МатериалыНовые", МатериалыНовые.Выгрузить());
	Запрос.УстановитьПараметр("Дата", Дата - 1);
	Запрос.УстановитьПараметр("СкладБракованнойПродукции", AMS_ВызовСервера.СкладБракованнойПродукции());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("НоменклатураБрак", НоменклатураБрак);
	Запрос.УстановитьПараметр("КоличествоНоменклатураБрак", КоличествоБрак);
	Запрос.УстановитьПараметр("ВидНоменклатурыМатериал", AMS_ВызовСервера.ВидНоменклатурыМатериал());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ МатериалыНовые
	|ИЗ
	|	&МатериалыНовые КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СкладБракованнойПродукции КАК Склад,
	|	&НоменклатураБрак КАК Номенклатура,
	|	&КоличествоНоменклатураБрак - ЕСТЬNULL(ТоварыНаСкладах.ВНаличииОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &СкладБракованнойПродукции
	|	И Номенклатура = &НоменклатураБрак) КАК ТоварыНаСкладах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Склад,
	|	МатериалыНовые.Номенклатура,
	|	МатериалыНовые.Количество - ЕСТЬNULL(ТоварыНаСкладах.ВНаличииОстаток, 0)
	|ИЗ
	|	МатериалыНовые КАК МатериалыНовые
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладах
	|		ПО МатериалыНовые.Номенклатура = ТоварыНаСкладах.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Склад КАК Склад,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Остаток КАК Остаток,
	|	Ном.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Остатки КАК Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО Остатки.Номенклатура = Ном.Ссылка
	|		И Ном.ВидНоменклатуры = &ВидНоменклатурыМатериал
	|ГДЕ
	|	Остатки.Остаток > 0";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();

	Пока Выб.Следующий() Цикл
		ТекстОшибки = "Для переработки недостаточно """ + Выб.Номенклатура + """ на складе """ + Выб.Склад
			+ """ в количестве " + Выб.Остаток + " " + Выб.ЕдиницаИзмерения + ".";

		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
